# ğŸˆ ë°ì´í„° í”„ë ˆì„

In [1]:
import pandas as pd
import numpy as np

##  âœ” ë¦¬ìŠ¤íŠ¸ë¡œ ë°ì´í„° í”„ë ˆì„ ë§Œë“¤ê¸°
* DataFrame([[list1],[list2]])
* ê° listëŠ” í•œ í–‰ìœ¼ë¡œ êµ¬ì„±ë¨
* í–‰ì˜ ì›ì†Œ ê°œìˆ˜ê°€ ë‹¤ë¥´ë©´ Noneê°’ìœ¼ë¡œ ì €ì¥

In [2]:
# 2ì°¨ì› ë¦¬ìŠ¤íŠ¸ë¡œ ë°ì´í„°í”„ë ˆì„ ìƒì„±
df = pd.DataFrame([['a','b','c'],['a','a','g'],['a','a']])
df

   0  1     2
0  a  b     c
1  a  a     g
2  a  a  None

## âœ” ë”•ì…”ë„ˆë¦¬ë¡œ ë°ì´í„°í”„ë ˆì„ ìƒì„±
* dictì˜ key => column

In [4]:
df1 = pd.DataFrame({'A':[90,80,70],
                    'B':[85,98,75],
                    'C':[88,99,77],
                    'D':[87,89,86]})
df1

    A   B   C   D
0  90  85  88  87
1  80  98  99  89
2  70  75  77  86

In [8]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2000002],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "ì§€ì—­": ["ìˆ˜ë„ê¶Œ", "ê²½ìƒê¶Œ", "ìˆ˜ë„ê¶Œ", "ê²½ìƒê¶Œ"],
    "2010-2015 ì¦ê°€ìœ¨":[0.0283, 0.0163, 0.0982,0.0141]
}
data

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2000002],
 '2005': [9762546, 3512547, 2517680, 2456016],
 '2000': [9853972, 3655437, 2466338, 2473990],
 'ì§€ì—­': ['ìˆ˜ë„ê¶Œ', 'ê²½ìƒê¶Œ', 'ìˆ˜ë„ê¶Œ', 'ê²½ìƒê¶Œ'],
 '2010-2015 ì¦ê°€ìœ¨': [0.0283, 0.0163, 0.0982, 0.0141]}

In [30]:
# ì—´ë°©í–¥ ì¸ë±ìŠ¤ columns
columns = ['ì§€ì—­','2015','2010','2005','2000','2010-2015 ì¦ê°€ìœ¨']

# í–‰ë°©í–¥ ì¸ë±ìŠ¤ 
index = ['ì„œìš¸','ë¶€ì‚°','ì¸ì²œ','ëŒ€êµ¬']

# DataFrame
df2 = pd.DataFrame(data, index=index, columns=columns)
df2

     ì§€ì—­     2015     2010     2005     2000  2010-2015 ì¦ê°€ìœ¨
ì„œìš¸  ìˆ˜ë„ê¶Œ  9904312  9631482  9762546  9853972         0.0283
ë¶€ì‚°  ê²½ìƒê¶Œ  3448737  3393191  3512547  3655437         0.0163
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2890451  2632035  2517680  2466338         0.0982
ëŒ€êµ¬  ê²½ìƒê¶Œ  2466052  2000002  2456016  2473990         0.0141

## âœ” ì‹œë¦¬ì¦ˆë¡œ ë°ì´í„° í”„ë ˆì„ ìƒì„±
* ê° Seriesì˜ ì¸ë±ìŠ¤ => column

In [31]:
a = pd.Series([100, 200, 300], ['a','b','d'])
b = pd.Series([101, 201, 301], ['a','b','k'])
c = pd.Series([110, 210, 310], ['a','b','c'])

pd.DataFrame([a,b,c], index=[100,101,102])

         a      b      d      k      c
100  100.0  200.0  300.0    NaN    NaN
101  101.0  201.0    NaN  301.0    NaN
102  110.0  210.0    NaN    NaN  310.0

## âœ” csv ë°ì´í„°ë¡œë¶€í„° Dataframe ìƒì„±
* ë°ì´í„° ë¶„ì„ì„ ìœ„í•´, dataframeì„ ìƒì„±í•˜ëŠ” ê°€ì¥ ì¼ë°˜ì ì¸ ë°©ë²•
* ë°ì´í„° ì†ŒìŠ¤ë¡œë¶€í„° ì¶”ì¶œëœ csvíŒŒì¼ë¡œë¶€í„° ìƒì„±
* pandas.read_csv() í•¨ìˆ˜ ì‚¬ìš©
* https://www.kaggle.com/hesh97/titanicdataset-traincsv/data

In [13]:
trainData = pd.read_csv('c:/Anaconda/train.csv')
trainData.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
# index_col : indexë¡œ ì‚¬ìš©í•  column ì„¤ì •
# usecols : ì‚¬ìš©í•  ë°ì´í„°ëª…ì„ ì ìŒ

trainData = pd.read_csv('c:/Anaconda/train.csv', 
                        index_col='PassengerId',
                        usecols=['PassengerId','Survived','Pclass','Name'])
trainData

,Survived,Pclass,Name
PassengerId,,,
1,0,3,"Braund, Mr. Owen Harris"
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
3,1,3,"Heikkinen, Miss. Laina"
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
5,0,3,"Allen, Mr. William Henry"
...,...,...,...
887,0,2,"Montvila, Rev. Juozas"
888,1,1,"Graham, Miss. Margaret Edith"
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie"""
890,1,1,"Behr, Mr. Karl Howell"
891,0,3,"Dooley, Mr. Patrick"

In [32]:
df2

     ì§€ì—­     2015     2010     2005     2000  2010-2015 ì¦ê°€ìœ¨
ì„œìš¸  ìˆ˜ë„ê¶Œ  9904312  9631482  9762546  9853972         0.0283
ë¶€ì‚°  ê²½ìƒê¶Œ  3448737  3393191  3512547  3655437         0.0163
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2890451  2632035  2517680  2466338         0.0982
ëŒ€êµ¬  ê²½ìƒê¶Œ  2466052  2000002  2456016  2473990         0.0141

In [21]:
# ì—´ë°©í–¥ ì¸ë±ìŠ¤ ì¶œë ¥
df2.columns

Index(['ì§€ì—­', '2015', '2010', '2005', '2000', '2010~2015 ì¦ê°€ìœ¨'], dtype='object')

In [22]:
# í–‰ë°©í–¥ ì¸ë±ìŠ¤ ì¶œë ¥
df2.index

Index(['ì„œìš¸', 'ë¶€ì‚°', 'ì¸ì²œ', 'ëŒ€êµ¬'], dtype='object')

## âœ” í–‰/ì—´ ì¸ë±ìŠ¤ ì´ë¦„ ì„¤ì •
* index.name
* columns.name

In [33]:
df2.index.name = 'ë„ì‹œ'
df2.columns.name = 'íŠ¹ì„±'
df2

íŠ¹ì„±   ì§€ì—­     2015     2010     2005     2000  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9904312  9631482  9762546  9853972         0.0283
ë¶€ì‚°  ê²½ìƒê¶Œ  3448737  3393191  3512547  3655437         0.0163
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2890451  2632035  2517680  2466338         0.0982
ëŒ€êµ¬  ê²½ìƒê¶Œ  2466052  2000002  2456016  2473990         0.0141

In [34]:
# ë°ì´í„°ë§Œ ì ‘ê·¼í•˜ë ¤ë©´ values ì†ì„±ì„ ì‚¬ìš©
# ë°˜í™˜ê°’ì€ array í˜•íƒœ

df2.values

array([['ìˆ˜ë„ê¶Œ', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['ê²½ìƒê¶Œ', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['ìˆ˜ë„ê¶Œ', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['ê²½ìƒê¶Œ', 2466052, 2000002, 2456016, 2473990, 0.0141]], dtype=object)

## âœ” ë°ì´í„°í”„ë ˆì„ì˜ ë°ì´í„° íŒŒì•…í•˜ê¸°

In [25]:
# DataFrameì˜ ê°œìš” ì¶œë ¥
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, ì„œìš¸ to ëŒ€êµ¬
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ì§€ì—­             4 non-null      object
 1   2015           4 non-null      int64
 2   2010           4 non-null      int64
 3   2005           4 non-null      int64
 4   2000           4 non-null      int64
 5   2010~2015 ì¦ê°€ìœ¨  0 non-null      object
dtypes: int64(4), object(2)
memory usage: 224.0+ bytes

In [26]:
# DataFrameì˜ í†µê³„ì  ê°œìš” ì¶œë ¥
df2.describe()

íŠ¹ì„±             2015          2010          2005          2000
count  4.000000e+00  4.000000e+00  4.000000e+00  4.000000e+00
mean   4.677388e+06  4.414178e+06  4.562197e+06  4.612434e+06
std    3.507776e+06  3.524531e+06  3.500545e+06  3.538749e+06
min    2.466052e+06  2.000002e+06  2.456016e+06  2.466338e+06
25%    2.784351e+06  2.474027e+06  2.502264e+06  2.472077e+06
50%    3.169594e+06  3.012613e+06  3.015114e+06  3.064714e+06
75%    5.062631e+06  4.952764e+06  5.075047e+06  5.205071e+06
max    9.904312e+06  9.631482e+06  9.762546e+06  9.853972e+06

In [27]:
# ë°ì´í„° í”„ë ˆì„ì˜ í–‰,ë ¬ ê°œìˆ˜ ì¶œë ¥
df2.shape

(4, 6)

In [35]:
df2

íŠ¹ì„±   ì§€ì—­     2015     2010     2005     2000  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9904312  9631482  9762546  9853972         0.0283
ë¶€ì‚°  ê²½ìƒê¶Œ  3448737  3393191  3512547  3655437         0.0163
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2890451  2632035  2517680  2466338         0.0982
ëŒ€êµ¬  ê²½ìƒê¶Œ  2466052  2000002  2456016  2473990         0.0141

In [28]:
# ì „ì¹˜ : í–‰ê³¼ ì—´ì˜ ìœ„ì¹˜ë¥¼ ë°”ê¿ˆ
dfT = df2.T    # ë”°ë¡œ ê°ì²´ë¥¼ ì§€ì •í•˜ë©´ ì›ë³¸ë°ì´í„°ë¥¼ ë°”ê¾¸ì§€ ì•Šê³  ì „ì¹˜í•  ìˆ˜ ìˆìŒ
dfT

ë„ì‹œ                  ì„œìš¸       ë¶€ì‚°       ì¸ì²œ       ëŒ€êµ¬
íŠ¹ì„±
ì§€ì—­                 ìˆ˜ë„ê¶Œ      ê²½ìƒê¶Œ      ìˆ˜ë„ê¶Œ      ê²½ìƒê¶Œ
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2000002
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010~2015 ì¦ê°€ìœ¨      NaN      NaN      NaN      NaN

In [43]:
# ì—´ì¶”ê°€ : ì¦ê°€ìœ¨ ë³€ê²½
df2['2010-2015ì¦ê°€ìœ¨'] = df2['2010-2015ì¦ê°€ìœ¨']*100
df2

íŠ¹ì„±   ì§€ì—­     2015     2010     2005     2000  2010-2015ì¦ê°€ìœ¨  2000-2015ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9904312  9631482  9762546  9853972       28300.0          1.45
ë¶€ì‚°  ê²½ìƒê¶Œ  3448737  3393191  3512547  3655437       16300.0         -1.82
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2890451  2632035  2517680  2466338       98200.0         14.81
ëŒ€êµ¬  ê²½ìƒê¶Œ  2466052  2000002  2456016  2473990       14100.0          0.41

In [37]:
df2['2000-2015ì¦ê°€ìœ¨'] = ((df2['2015'] - df2['2005'])/df2['2005']*100).round(2)
df2

íŠ¹ì„±,ì§€ì—­,2015,2010,2005,2000,2010-2015 ì¦ê°€ìœ¨,2010-2015ì¦ê°€ìœ¨,2000-2015ì¦ê°€ìœ¨
ë„ì‹œ,,,,,,,,
ì„œìš¸,ìˆ˜ë„ê¶Œ,9904312,9631482,9762546,9853972,0.0283,2.83,1.45
ë¶€ì‚°,ê²½ìƒê¶Œ,3448737,3393191,3512547,3655437,0.0163,1.63,-1.82
ì¸ì²œ,ìˆ˜ë„ê¶Œ,2890451,2632035,2517680,2466338,0.0982,9.82,14.81
ëŒ€êµ¬,ê²½ìƒê¶Œ,2466052,2000002,2456016,2473990,0.0141,1.41,0.41

In [39]:
# ì—´ ì‚­ì œ
del df2['2010-2015 ì¦ê°€ìœ¨']
df2

íŠ¹ì„±   ì§€ì—­     2015     2010     2005     2000  2010-2015ì¦ê°€ìœ¨  2000-2015ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9904312  9631482  9762546  9853972          2.83          1.45
ë¶€ì‚°  ê²½ìƒê¶Œ  3448737  3393191  3512547  3655437          1.63         -1.82
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2890451  2632035  2517680  2466338          9.82         14.81
ëŒ€êµ¬  ê²½ìƒê¶Œ  2466052  2000002  2456016  2473990          1.41          0.41

## ğŸˆë°ì´í„° í”„ë ˆì„ ì¸ë±ì‹±
1. ì—´ì¸ë±ì‹±
2. ì¸ë±ì„œë¥¼ ì‚¬ìš©í•˜ì§€ ì•ŠëŠ” í–‰ ì¸ë±ì‹±

## âœ” ì—´ì¸ë±ì‹±

In [44]:
# ì¸ë±ìŠ¤ë¡œ ë¼ë²¨ê°’ 1ê°œ ì‚¬ìš©
df2['ì§€ì—­']

ë„ì‹œ
ì„œìš¸    ìˆ˜ë„ê¶Œ
ë¶€ì‚°    ê²½ìƒê¶Œ
ì¸ì²œ    ìˆ˜ë„ê¶Œ
ëŒ€êµ¬    ê²½ìƒê¶Œ
Name: ì§€ì—­, dtype: object

In [45]:
# ì—´ 1ê°œë¥¼ ì ‘ê·¼í•  ë•ŒëŠ” ì—°ì‚°ì ì‚¬ìš©ê°€ëŠ¥ : df.ì»¬ëŸ¼ëª…
df2.ì§€ì—­

ë„ì‹œ
ì„œìš¸    ìˆ˜ë„ê¶Œ
ë¶€ì‚°    ê²½ìƒê¶Œ
ì¸ì²œ    ìˆ˜ë„ê¶Œ
ëŒ€êµ¬    ê²½ìƒê¶Œ
Name: ì§€ì—­, dtype: object

In [46]:
# ì§€ì—­ ì»¬ëŸ¼ ë°ì´í„° ìœ í˜• í™•ì¸
type(df2.ì§€ì—­)

pandas.core.series.Series

In [49]:
# ì—´ì„ ì¶”ì¶œí•  ë•Œ dfë¡œ ë°˜í™˜ë°›ê³ ì í•˜ë©´ []ë¥¼ ì‚¬ìš©
# ë¦¬ìŠ¤íŠ¸ë¡œ ì¸ë±ì‹± : dfë¡œ ë°˜í™˜

df2[['2010','2015']]

íŠ¹ì„±     2010     2015
ë„ì‹œ
ì„œìš¸  9631482  9904312
ë¶€ì‚°  3393191  3448737
ì¸ì²œ  2632035  2890451
ëŒ€êµ¬  2000002  2466052

In [50]:
# ì—ëŸ¬ê°€ ë‚¬ì„ ë•Œ ë¬´ìŠ¨ ì—ëŸ¬ê°€ ë‚¬ëŠ” ì§€ í™•ì¸

try : 
    df2[0] # keyerror ë°œìƒ
except Exception as e :
    print(type(e))

<class 'KeyError'>

In [52]:
df3 = pd.DataFrame(np.arange(0,12).reshape(3,4))
df3

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [53]:
df3[0]

0    0
1    4
2    8
Name: 0, dtype: int32

In [57]:
df3[[1,3]]

   1   3
0  1   3
1  5   7
2  9  11

In [58]:
df2

íŠ¹ì„±   ì§€ì—­     2015     2010     2005     2000  2010-2015ì¦ê°€ìœ¨  2000-2015ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9904312  9631482  9762546  9853972       28300.0          1.45
ë¶€ì‚°  ê²½ìƒê¶Œ  3448737  3393191  3512547  3655437       16300.0         -1.82
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2890451  2632035  2517680  2466338       98200.0         14.81
ëŒ€êµ¬  ê²½ìƒê¶Œ  2466052  2000002  2456016  2473990       14100.0          0.41

In [59]:
df2[:1]

íŠ¹ì„±   ì§€ì—­     2015     2010     2005     2000  2010-2015ì¦ê°€ìœ¨  2000-2015ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9904312  9631482  9762546  9853972       28300.0          1.45

In [60]:
df2[0:1]

íŠ¹ì„±   ì§€ì—­     2015     2010     2005     2000  2010-2015ì¦ê°€ìœ¨  2000-2015ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9904312  9631482  9762546  9853972       28300.0          1.45

In [61]:
df2[1:3]

íŠ¹ì„±   ì§€ì—­     2015     2010     2005     2000  2010-2015ì¦ê°€ìœ¨  2000-2015ì¦ê°€ìœ¨
ë„ì‹œ
ë¶€ì‚°  ê²½ìƒê¶Œ  3448737  3393191  3512547  3655437       16300.0         -1.82
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2890451  2632035  2517680  2466338       98200.0         14.81

In [64]:
df2['ì„œìš¸':'ë¶€ì‚°']

íŠ¹ì„±   ì§€ì—­     2015     2010     2005     2000  2010-2015ì¦ê°€ìœ¨  2000-2015ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9904312  9631482  9762546  9853972       28300.0          1.45
ë¶€ì‚°  ê²½ìƒê¶Œ  3448737  3393191  3512547  3655437       16300.0         -1.82

In [76]:
# ê°œë³„ìš”ì†Œ ì ‘ê·¼[ì—´][í–‰]
df2['2015','2005']['ì„œìš¸':'ë¶€ì‚°']   # ì—´ì„ ì—¬ëŸ¬ê°œ ë“¤ê³ ì˜¬ ë–„ëŠ” ì½¤ë§ˆë¡œ êµ¬ë¶„. í–‰ì„ ìŠ¬ë¼ì´ì‹±

KeyError: ('2015', '2005')

* ë°ì´í„° í”„ë ˆì„ì€ ì—´ê¸°ì¤€ìœ¼ë¡œ ì ‘ê·¼ ì›ì¹™
* í–‰ê¸°ì¤€ ì ‘ê·¼ì„ ìœ„í•´ì„œëŠ” ìŠ¬ë¼ì´ì‹±ì„ ì ìš©
* í–‰ê³¼ì—´ì„ ê°™ì´ ì ìš© : [ì—´ì´ë¦„][í–‰ì´ë¦„]

## ğŸˆ ë°ì´í„° í”„ë ˆì„ ì¸ë±ì„œ : loc, iloc

In [71]:
# ì‹¤í–‰ ì „ì— ì•„ë˜ í•¨ìˆ˜ë“¤ì„ ëª¨ë‘ ì‹¤í–‰í•˜ëŠ”ê²Œ ì¢‹ìŒ

import numpy as np
import pandas as pd

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"     # í•œ ì¹¸ì— ì—¬ëŸ¬ í•¨ìˆ˜ ê²°ê³¼ê°’ì„ ê°œë³„ì ìœ¼ë¡œ í™•ì¸ ê°€ëŠ¥

## âœ” loc ì¸ë±ì„œ ( í–‰ ìš°ì„  ì¸ë±ì„œ )

In [81]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4),
                 index=['a','b','c'],
                 columns = ['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [82]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [85]:
df.loc['a':'c']

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [86]:
df.loc[['a','c']]  # locì„ ì“°ë©´ í–‰ê¸°ì¤€

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [87]:
df[['B','C']]   # locì„ ì•ˆì“°ë©´ ì—´ê¸°ì¤€

    B   C
a  11  12
b  15  16
c  19  20

In [90]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [92]:
df[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [93]:
def sel_row(df):
    return df.A > 15

In [94]:
sel_row(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [97]:
df.loc[sel_row(df)]

    A   B   C   D
c  18  19  20  21

## âœ” loc ì¸ë±ì„œ ìŠ¬ë¼ì´ì‹±

In [101]:
df2 = pd.DataFrame(np.arange(10,26).reshape(4,4),
                  columns=['a','b','c','d'])
df2

    a   b   c   d
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [102]:
# ê°’ ì¸ë±ì‹±
df2.loc[1:2]

    a   b   c   d
1  14  15  16  17
2  18  19  20  21

In [103]:
# ìœ„ì¹˜ ì¸ë±ì‹± : ì´ˆê¸°ìœ„ì¹˜:ëìœ„ì¹˜+1
df2[1:2]

    a   b   c   d
1  14  15  16  17

In [104]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [105]:
df.loc['a','A']

10

In [107]:
df.loc['a','A'] = 50
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [108]:
# a í–‰ ëª¨ë“  ì—´ ë°˜í™˜
df.loc['a']    # ë°˜í™˜ê°’ì´ ì‹œë¦¬ì¦ˆë¡œ ë°˜í™˜

A    50
B    11
C    12
D    13
Name: a, dtype: int32

In [109]:
df.loc[['a']]  # ë°ì´í„°í”„ë ˆì„ìœ¼ë¡œ ë°˜í™˜

    A   B   C   D
a  50  11  12  13

In [110]:
df.loc['a',:] # ì‹œë¦¬ì¦ˆë¡œ ë°˜í™˜

A    50
B    11
C    12
D    13
Name: a, dtype: int32

In [112]:
# aí–‰ì˜ B,C ì—´ì„ ë°˜í™˜
df
df.loc['a','B':'C']

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

B    11
C    12
Name: a, dtype: int32

In [116]:
# bí–‰ë¶€í„° ëª¨ë“  í–‰ì˜ Aì—´
df.loc['b':,'A']

b    14
c    18
Name: A, dtype: int32

In [122]:
# a,bí–‰ì˜ B,Dì—´ì„ ë°ì´í„°í”„ë ˆì„ìœ¼ë¡œ ë°˜í™˜í•˜ì‹œì˜¤
df
df.loc[['a','b'],['B','D']]

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

    B   D
a  11  13
b  15  17

In [123]:
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [124]:
# 0í–‰ 1ì—´
df.iloc[0,1]

11

In [125]:
# ë‘˜ ë‹¤ ì¸ë±ì‹± ì£¼ë©´ ë°ì´í„°í”„ë ˆì„ í˜•íƒœ
df.iloc[0:2,1:2]

    B
a  11
b  15

In [126]:
# í•œìª½ë§Œ ì£¼ë©´ ì‹œë¦¬ì¦ˆ í˜•íƒœ
df.iloc[0:2,1]

a    11
b    15
Name: B, dtype: int32

In [128]:
df.iloc[0,2:]

C    12
D    13
Name: a, dtype: int32

In [133]:
df
df.iloc[0,-2:]    # -1ì€ ì œì¼ ë ì¸ë±ìŠ¤, -2ëŠ” ëì—ì„œ ë‘ ë²ˆì§¸ ì¸ë±ìŠ¤
df.iloc[0:1,-2:]

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

C    12
D    13
Name: a, dtype: int32

    C   D
a  12  13

## â“ ì—°ìŠµë¬¸ì œ

In [136]:
df = pd.DataFrame(np.arange(25,50).reshape(5,5),
                 index=['a','b','c','d','e'],
                 columns=['A','B','C','D','E'])
df

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

In [137]:
# Aì—´ ì¶”ì¶œ
df['A']

a    25
b    30
c    35
d    40
e    45
Name: A, dtype: int32

In [139]:
# 0í–‰ë¶€í„° 2í–‰ê¹Œì§€ ì¶”ì¶œ
df.iloc[0:3]

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

In [148]:
# 1í–‰ì˜ 3,4ì—´ ì¶”ì¶œ
df.iloc[1:2,3:5]
df.iloc[[1],[3,4]]

    D   E
b  33  34

    D   E
b  33  34

In [147]:
# aí–‰ì—ì„œ cí–‰ê¹Œì§€ ì¤‘ Bì—´ê³¼ Dì—´ ì¶”ì¶œ
df.loc['a':'c',['B','D']]

    B   D
a  26  28
b  31  33
c  36  38